Vulnerability-report-main/ADDRVAL-ESB/AddrValidation-war/src/test/resources/TEST_ONE_FC_D_Full_Details.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://validator5.AddressDoctor.com/Webservice5/v4">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:Process>
         <v4:parameters>
            <v4:ProcessMode>FASTCOMPLETION</v4:ProcessMode>
         </v4:parameters>
         <!--Optional:-->
         <v4:addresses>
            <!--Zero or more repetitions:-->
            <v4:Address>
               
               <v4:Street>
                  <!--Zero or more repetitions:-->
                  <v4:string>1405 Douglas Street</v4:string>
               </v4:Street>
               
               <v4:Locality>
                  <!--Zero or more repetitions:-->
                  <v4:string>Victoria</v4:string>
               </v4:Locality>
               
               <v4:PostalCode>
                  <!--Zero or more repetitions:-->
                  <v4:string></v4:string>
               </v4:PostalCode>
               
               <v4:Province>
                  <!--Zero or more repetitions:-->
                  <v4:string></v4:string>
               </v4:Province>
               
               <v4:Country>
                  <!--Zero or more repetitions:-->
                  <v4:string>Canada</v4:string>
               </v4:Country>
         
               <v4:HouseNumber>
                   <!--Zero or more repetitions:-->
                   <v4:string></v4:string>
               </v4:HouseNumber>
         
               <v4:Building>
                   <!--Zero or more repetitions:-->
                   <v4:string></v4:string>
               </v4:Building>
               
               <v4:SubBuilding>
                   <!--Zero or more repetitions:-->
                   <v4:string></v4:string>
               </v4:SubBuilding>
         
               <v4:DeliveryService>
                   <!--Zero or more repetitions:-->
                   <v4:string></v4:string>
               </v4:DeliveryService>
         
               <v4:Organization>
                   <!--Zero or more repetitions:-->
                   <v4:string></v4:string>
               </v4:Organization>
         
               <v4:Contact>
                   <!--Zero or more repetitions:-->
                   <v4:string></v4:string>
               </v4:Contact>
         
               <v4:Residue>
                   <!--Zero or more repetitions:-->
                   <v4:string></v4:string>
               </v4:Residue>
         
               <v4:RecipientLines>
                  <!--Zero or more repetitions:-->
                  <v4:string></v4:string>
               </v4:RecipientLines>
               
               <v4:DeliveryAddressLines>
                  <!--Zero or more repetitions:-->
                  <v4:string></v4:string>
               </v4:DeliveryAddressLines>
               
               <v4:CountrySpecificLocalityLine>
                  <!--Zero or more repetitions:-->
                  <v4:string></v4:string>
               </v4:CountrySpecificLocalityLine>
               
               <v4:FormattedAddress>
                  <!--Zero or more repetitions:-->
                  <v4:string></v4:string>
               </v4:FormattedAddress>
               
               <!--Zero or more repetitions:-->
               <v4:AdditionalAddressInformation>
                  <!--Optional:-->
                  <v4:Name>?</v4:Name>
                  <!--Optional:-->
                  <v4:Value>?</v4:Value>
               </v4:AdditionalAddressInformation>
               
               <!--Optional:-->
               <v4:AddressDetailed>
                  <!--Optional:-->
                  <v4:Organization>
                     <!--Zero or more repetitions:-->
                     <v4:OrganizationDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE>?</v4:COMPLETE>
                     </v4:OrganizationDetailed>
                     <v4:OrganizationDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NAME>?</v4:NAME>
                     </v4:OrganizationDetailed>
                     <v4:OrganizationDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:DESCRIPTOR>?</v4:DESCRIPTOR>
                     </v4:OrganizationDetailed>
                     <v4:OrganizationDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:DEPARTMENT>?</v4:DEPARTMENT>
                     </v4:OrganizationDetailed>
                  </v4:Organization>
                  <!--Optional:-->
                  <v4:Contact>
                     <!--Zero or more repetitions:-->
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE>?</v4:COMPLETE>
                     </v4:ContactDetailed>
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:FIRST_NAME>?</v4:FIRST_NAME>
                     </v4:ContactDetailed>
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:MIDDLE_NAME>?</v4:MIDDLE_NAME>
                     </v4:ContactDetailed>
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:LAST_NAME>?</v4:LAST_NAME>
                     </v4:ContactDetailed>
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NAME>?</v4:NAME>
                     </v4:ContactDetailed>
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:TITLE>?</v4:TITLE>
                     </v4:ContactDetailed>
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:FUNCTION>?</v4:FUNCTION>
                     </v4:ContactDetailed>
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:SALUTATION>?</v4:SALUTATION>
                     </v4:ContactDetailed>
                     <v4:ContactDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:GENDER>?</v4:GENDER>
                     </v4:ContactDetailed>
                  </v4:Contact>
                  <!--Optional:-->
                  <v4:Building>
                     <!--Zero or more repetitions:-->
                     <v4:BuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE>?</v4:COMPLETE>
                     </v4:BuildingDetailed>
                     <v4:BuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE_WITH_SUBBUILDING>?</v4:COMPLETE_WITH_SUBBUILDING>
                     </v4:BuildingDetailed>
                     <v4:BuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NAME>?</v4:NAME>
                     </v4:BuildingDetailed>
                     <v4:BuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NUMBER>?</v4:NUMBER>
                     </v4:BuildingDetailed>
                     <v4:BuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:DESCRIPTOR>?</v4:DESCRIPTOR>
                     </v4:BuildingDetailed>
                  </v4:Building>
                  <!--Optional:-->
                  <v4:SubBuilding>
                     <!--Zero or more repetitions:-->
                     <v4:SubBuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE>?</v4:COMPLETE>
                     </v4:SubBuildingDetailed>
                     <v4:SubBuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NAME>?</v4:NAME>
                     </v4:SubBuildingDetailed>
                     <v4:SubBuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NUMBER>?</v4:NUMBER>
                     </v4:SubBuildingDetailed>
                     <v4:SubBuildingDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:DESCRIPTOR>?</v4:DESCRIPTOR>
                     </v4:SubBuildingDetailed>
                  </v4:SubBuilding>
                  <!--Optional:-->
                  <v4:Street>
                     <!--Zero or more repetitions:-->
                     <v4:StreetDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE>?</v4:COMPLETE>
                     </v4:StreetDetailed>
                     <v4:StreetDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE_WITH_NUMBER>?</v4:COMPLETE_WITH_NUMBER>
                     </v4:StreetDetailed>
                     <v4:StreetDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NAME>?</v4:NAME>
                     </v4:StreetDetailed>
                     <v4:StreetDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:PRE_DESCRIPTOR>?</v4:PRE_DESCRIPTOR>
                     </v4:StreetDetailed>
                     <v4:StreetDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:POST_DESCRIPTOR>?</v4:POST_DESCRIPTOR>
                     </v4:StreetDetailed>
                     <v4:StreetDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:PRE_DIRECTIONAL>?</v4:PRE_DIRECTIONAL>
                     </v4:StreetDetailed>
                     <v4:StreetDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:POST_DIRECTIONAL>?</v4:POST_DIRECTIONAL>
                     </v4:StreetDetailed>
                     <v4:StreetDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ADD_INFO>?</v4:ADD_INFO>
                     </v4:StreetDetailed>
                  </v4:Street>
                  <!--Optional:-->
                  <v4:HouseNumber>
                     <!--Zero or more repetitions:-->
                     <v4:HouseNumberDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE>?</v4:COMPLETE>
                     </v4:HouseNumberDetailed>
                     <v4:HouseNumberDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NUMBER>?</v4:NUMBER>
                     </v4:HouseNumberDetailed>
                     <v4:HouseNumberDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:DESCRIPTOR>?</v4:DESCRIPTOR>
                     </v4:HouseNumberDetailed>
                     <v4:HouseNumberDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ADD_INFO>?</v4:ADD_INFO>
                     </v4:HouseNumberDetailed>
                  </v4:HouseNumber>
                  <!--Optional:-->
                  <v4:DeliveryService>
                     <!--Zero or more repetitions:-->
                     <v4:DeliveryServiceDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE>?</v4:COMPLETE>
                     </v4:DeliveryServiceDetailed>
                     <v4:DeliveryServiceDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:DESCRIPTOR>?</v4:DESCRIPTOR>
                     </v4:DeliveryServiceDetailed>
                     <v4:DeliveryServiceDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NUMBER>?</v4:NUMBER>
                     </v4:DeliveryServiceDetailed>
                     <v4:DeliveryServiceDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ADD_INFO>?</v4:ADD_INFO>
                     </v4:DeliveryServiceDetailed>
                  </v4:DeliveryService>
                  <!--Optional:-->
                  <v4:Locality>
                     <!--Zero or more repetitions:-->
                     <v4:LocalityDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COMPLETE>?</v4:COMPLETE>
                     </v4:LocalityDetailed>
                     <v4:LocalityDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NAME>?</v4:NAME>
                     </v4:LocalityDetailed>
                     <v4:LocalityDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:PREFERRED_NAME>?</v4:PREFERRED_NAME>
                     </v4:LocalityDetailed>
                     <v4:LocalityDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:SORTING_CODE>?</v4:SORTING_CODE>
                     </v4:LocalityDetailed>
                     <v4:LocalityDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ADD_INFO>?</v4:ADD_INFO>
                     </v4:LocalityDetailed>
                  </v4:Locality>
                  <!--Optional:-->
                  <v4:PostalCode>
                     <!--Zero or more repetitions:-->
                     <v4:PostalCodeDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:FORMATTED>?</v4:FORMATTED>
                     </v4:PostalCodeDetailed>
                     <v4:PostalCodeDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:UNFORMATTED>?</v4:UNFORMATTED>
                     </v4:PostalCodeDetailed>
                     <v4:PostalCodeDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:BASE>?</v4:BASE>
                     </v4:PostalCodeDetailed>
                     <v4:PostalCodeDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ADD_ON>?</v4:ADD_ON>
                     </v4:PostalCodeDetailed>
                  </v4:PostalCode>
                  <!--Optional:-->
                  <v4:Province>
                     <!--Zero or more repetitions:-->
                     <v4:ProvinceDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:COUNTRY_STANDARD>?</v4:COUNTRY_STANDARD>
                     </v4:ProvinceDetailed>
                     <v4:ProvinceDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ABBREVIATION>?</v4:ABBREVIATION>
                     </v4:ProvinceDetailed>
                     <v4:ProvinceDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:EXTENDED>?</v4:EXTENDED>
                     </v4:ProvinceDetailed>
                     <v4:ProvinceDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ISO>?</v4:ISO>
                     </v4:ProvinceDetailed>
                  </v4:Province>
                  <!--Optional:-->
                  <v4:Country>
                     <!--Zero or more repetitions:-->
                     <v4:CountryDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NAME_EN>?</v4:NAME_EN>
                     </v4:CountryDetailed>
                     <v4:CountryDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ABBREVIATION>?</v4:ABBREVIATION>
                     </v4:CountryDetailed>
                     <v4:CountryDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ISO2>?</v4:ISO2>
                     </v4:CountryDetailed>
                     <v4:CountryDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ISO3>?</v4:ISO3>
                     </v4:CountryDetailed>
                     <v4:CountryDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:ISO_NUMBER>?</v4:ISO_NUMBER>
                     </v4:CountryDetailed>
                  </v4:Country>
                  <!--Optional:-->
                  <v4:Residue>
                     <!--Zero or more repetitions:-->
                     <v4:ResidueDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:NECESSARY>?</v4:NECESSARY>
                     </v4:ResidueDetailed>
                     <v4:ResidueDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:SUPERFLUOUS>?</v4:SUPERFLUOUS>
                     </v4:ResidueDetailed>
                     <v4:ResidueDetailed>
                        <v4:Item>?</v4:Item>
                        <!--Optional:-->
                        <v4:UNRECOGNIZED>?</v4:UNRECOGNIZED>
                     </v4:ResidueDetailed>
                  </v4:Residue>
               </v4:AddressDetailed>
            </v4:Address>
         </v4:addresses>
         <!--Optional:-->
         <v4:enrichments>
            <!--Zero or more repetitions:-->
            <v4:Enrichment>
               <!--Optional:-->
               <v4:Type>?</v4:Type>
               <!--Optional:-->
               <v4:PayloadXml>?</v4:PayloadXml>
            </v4:Enrichment>
         </v4:enrichments>
      </v4:Process>
   </soapenv:Body>
</soapenv:Envelope>